Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/affidavit.html.txt.tmx
Source language: en
Languages: ga

source: An affidavit is a written sworn statement from a witness in a case
ga: Ráiteas faoi mhionn ó fhinné is ea mionnscríbhinn

source: It is a document that sets out in paragraph form the evidence that the witness wishes to give
ga: Doiciméad is ea í a leagann amach i bparagraif an fhianaise ar mhian leis an bhfinné a thabhairt

source: Affidavits are usually written and prepared by a solicitor or a barrister after having obtained all the necessary information from the witness
ga: Go hiondúil déanann aturnae nó abhcóide na mionnscríbhinní a scríobh agus a ullmhú tar éis an t-eolas riachtanach a bhailiú ón bhfinné

source: When the affidavit is ready, the witness must go before a Commissioner for Oaths
ga: Nuair atá an mionnscríbhinn réidh, ní mór don fhinné dul os comhair Coimisnéara Mionnaí

source: The Commissioner for Oaths will check that the person swearing the oath has read the affidavit and fully understands the contents
ga: Cinnteoidh Coimisinéir na Mionnaí go bhfuil an mionnscríbhinn léite agus tuigthe go hiomlán ag an té atá ag tabhairt an míonna

source: The witness will be asked to raise the Bible and to repeat the words of the oath
ga: Iarrfar ar an bhfinné an Bíobla a ardú agus focail an mhíonna a athrá

source: If the witness does not wish to swear an oath on the Bible, he or she may make an affirmation
ga: Murar mhian leis an bhfinné mionn a thabhairt ar an mBíobla, is féidir leis nó léi dearbhascadh a dhéanamh

source: He or she will then sign the affidavit
ga: Is féidir leis nó léi an mionnscríbhinn a shíniú ansin

source: The Commissioner for Oaths will verify that the affidavit was properly sworn by completing a jurat on the affidavit
ga: Déanfaidh Coimisinéir na Mionnaí a dhearbhú gur tugadh an mionnscríbhinn go ceart trí jurat a chur ar an mionnscríbhinn

source: It may then be submitted as evidence to the court by lodging it in the appropriate court office and sending a duplicate to the other party in the case
ga: Is féidir í a chur os comhair na cúirte ansin mar fhianaise ach í a fhágáil san oifig chúirte chuí agus cóip a chur chuig an páirtí eile sa chás

source: Some cases do not involve an oral hearing with witnesses giving evidence in court
ga: I roinnt cásanna ní bhactar le h-éisteacht bhéil le fianaise á tabhairt ag finnéithe sa chúirt

source: Those cases may be dealt with by affidavit only
ga: Ní féidir plé leis na cásanna sin ach trí mhionnscríbhinn amháin

source: For example, if the Plaintiff issues a summary summons, it will be accompanied by an affidavit setting out the facts of the case
ga: Mar shampla, má eisíonn an Comhghearánaí toghairm achomair, beidh mionnscríbhinn leis a leagfaidh amach fíricí an cháis

source: The Defendant may then respond by affidavit
ga: Is féidir leis an gCosantóir freagairt trí mhionnscríbhinn ansin

source: The judge may be able to decide the case by simply reading the affidavits
ga: Is féidir leis an mbreitheamh an cás a shocrú trí na mionnscríbhinní a léamh

source: This is a swifter and less expensive procedure
ga: Nós imeacht níos tapúla agus níos saoire é seo

source: An affidavit must include the following information:
ga: Ní mór go n-áirítear le mionnscríbhinn an fhaisnéis a leanas:

source: • The identity of the person making the affidavit and their occupation and address
ga: • Aitheantas an duine a bhfuil an mhionnscríbhinn á déanamh acu agus a ngairm agus a seoladh

source: • It must state that the witness is over 18 years of age or, if not over 18, the age of the witness
ga: • Ní mór go luafar inti go bhfuil an finné os cionn 18 mbliana d’aois nó, mura bhfuil siad os cionn 18 mbliana d’aois, ní mór aois an fhinné a lua

source: • In general, the evidence must be confined to such facts as the witness is able to prove of their own knowledge and must state the means of such knowledge
ga: • Go ginearálta, ní mór nach bhfuil san fhianaise ach na fíricí sin ar féidir leis an bhfinné a chruthú lena n-eolas féin agus ní mór go luafar meáin an eolais sin

source: • The affidavit must be dated and signed by the witness
ga: • Ní mór don fhinné an mhionnscríbhinn a dhátú agus a shíniú

source: • The affidavit must contain a jurat which is a section where the Commissioner for Oaths verifies that the affidavit was properly sworn
ga: • Ní mór go bhfuil giúrád sa mhionnscríbhinn, ar mír í ina bhfíoraíonn an Coimisinéir gur mionnaíodh an mhionnscríbhinn i gceart

source: The evidence that the witness gives must be set out clearly in numbered paragraph format
ga: Ní mór an fhianaise a thugann an finné bheith leagtha amach go soiléir i bhformáid alt uimhrithe

source: The language is less formal that the language of formal pleadings
ga: Níl an friotal chomh foirmiúil céanna a bhíonn friotal pléadálacha foirmiúla

source: The rules for affidavits are set out in the court rules for the Superior, Circuit and District courts which are available on the Courts Service website
ga: Leagtar amach na rialacha maidir le mionnscríbhinní i rialacha na cúirte do na hUaschúirteanna, na Cúirteanna Cuarda agus Dúiche atá ar fáil ar láithreán gréasáin na Seirbhíse Cúirteanna

source: The stamp duty that must be paid when an affidavit is lodged in the Circuit Court office is €15
ga: Is é €15 an stampdhleacht a chaithfear a íoc nuair a chuirtear mionnscríbhinn isteach in oifig na Cúirte Cuarda

source: In the High Court Central office, the duty is €20
ga: I lároifig na hArdchúirte is é €20 an stampdhleacht

source: Your solicitor and barrister will also charge fees for their services
ga: Iarrfaidh do aturnae agus d'abhcóide táillí ar a gcuid seirbhísí chomh maith

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
